//
//  RexView.swift
//  HW1
//
//  Created by User15 on 2020/6/23.
//  Copyright © 2020 test. All rights reserved.
//

import SwiftUI

struct RexView: View {
    var body: some View {
        Text("暴龍（學名：Tyrannosaurus rex），是暴龍屬（Tyrannosaurus）目前僅有的一個有效物種，屬於暴龍科的巨型獸腳類恐龍，名字的拉丁文含義是「蜥蜴中的暴君」。其身長估計可達13公尺，臀部高度約4公尺，體重約6.8公噸。暴龍屬擁有目前已知動物中最大級別的咬合力之一，但並不是最大的，其咬合力將近6公噸、相當於一隻大象的重量。如同其他的暴龍科恐龍一樣，暴龍屬是二足、肉食性恐龍，擁有大型頭顱骨，並藉由長而重的尾巴來保持平衡。相對於牠們大而強壯的後肢和巨大的身體，暴龍的前肢非常小，但有研究發現卻十分強壯。長久以來，暴龍被認為只有兩根手指，但在2007年發現的一個完整的暴龍化石，顯示牠們也可能具有三根手指。有些研究人員還在標本上發現了軟組織與蛋白質；但暴龍屬的食性、生理機能以及移動速度仍在爭論中，暴龍被認為是種掠食動物、以大型食草恐龍為食，但也有少數科學家認為暴龍是種積極的食腐動物。暴龍屬生存於白堊紀末期的馬斯垂克階，距今約6700萬年到6500萬年，是白堊紀-第三紀滅絕事件前最後的恐龍種群之一。其化石分布於北美洲的美國整個西部地區、加拿大西南部，其中又以美國的化石為最多，暴龍屬的分布範圍較其他暴龍科更廣；白堊紀晚期的北美洲西部是個獨立的拉臘米迪亞大陸。目前已有超過30個雷克斯暴龍的標本被確認，包含幾具完整度很高的化石。暴龍的大量化石材料，使科學家們有足夠的資料研究暴龍生理的各個層面，包括生長模式與生物力學。").padding()
        .background(Color.yellow)
    }
}

struct RexView_Previews: PreviewProvider {
    static var previews: some View {
        RexView()
    }
}
