//
//  SpinosaurusView.swift
//  HW1
//
//  Created by User15 on 2020/6/23.
//  Copyright © 2020 test. All rights reserved.
//

import SwiftUI

struct SpinosaurusView: View {
    var body: some View {
        Text("棘龍屬（學名：Spinosaurus，意思為「有棘的蜥蜴」），又翻譯為棘背龍、脊背龍，是種獸腳亞目恐龍，生存於白堊紀的非洲北部，約為1億1400萬年到6500萬年前。棘龍最初是在1912年由德國古生物學家恩斯特·斯特莫（Ernst Stromer）發現於埃及，並在1915年加以敘述、命名。最初的標本在第二次世界大戰期間被摧毀，但最近幾年發現了其他的頭顱骨、爪子、胳膊、尾錐、頭冠等身體部分的化石。目前仍不完全確定棘龍屬有一個種還是兩個種，其中最著名的種是20世紀發現於埃及的埃及棘龍（S. aegyptiacus），而第二個種是在21世紀於摩洛哥發現的摩洛哥棘龍（S. marocannus），化石發現於摩洛哥，其有效性仍備受質疑。棘龍的背部有明顯的長棘，是由脊椎骨的神經棘延長而成，長度可達2.2公尺，長棘之間推斷有皮膚連結，形成一個巨大的帆狀物；然而在化石發現初期有些科學家認為這些長棘是由肌肉覆蓋著，形成隆肉或是背脊。對於這帆狀物的功能，目前已有數種看法，包括調節體溫、視覺展示物。棘龍的頭顱骨長寬但是較矮，外形類似上龍類，棘龍被認為是以中型鳥臀目和蜥腳類恐龍以及魚類為食。2010~2020年以來的研究，顯示棘龍牙齒的氧同位素親水度頗高，是非常適應水中的恐龍，牠四腳著地、尾部扁平的骨骼構造也顯示了棘龍對水棲生活做出的形態演化。推算顯示棘龍身長12到14公尺，高度約為2.1至4.8公尺，體重為4到8公噸。棘龍是目前已知最大型的陸生肉食性恐龍之一、也是長度最長的肉食性恐龍，但是重量卻低於暴龍或者低於其它大型獸腳類；而棘龍因為以四肢行走，其臀高均低於其它體型相近的大型獸腳類掠食者。").padding()
        .background(Color.yellow)
    }
}

struct SpinosaurusView_Previews: PreviewProvider {
    static var previews: some View {
        SpinosaurusView()
    }
}
